# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.25  # scales convolution channels

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C2f, [128, True]]  # 2（官方原生C2f，n=2轻量化）
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 4, C2f, [256, True]] # 4（官方原生C2f，n=4轻量化）
  - [-1, 1, CBAM, [256, 7]]   # 5
  - [-1, 1, Conv, [512, 3, 2]]  # 6   p4/16
  - [-1, 4, C2f, [512, True]]  # 7（官方原生C2f，n=4轻量化）
  - [-1, 1, CBAM, [ 512, 7 ] ]   # 8
  - [-1, 1, Conv, [1024, 3, 2]]  #  9  7-P5/32
  - [-1, 2, C2f, [1024, True]] # 10（官方原生C2f，n=2轻量化）
  - [-1, 1, SPPF, [1024, 5]]  # 11

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 7], 1, Concat, [1]]  # cat backbone P4
  - [-1, 2, C2f, [512]]  # 14

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 2, C2f, [256]]  # 17 (P3/8-small)
  - [-1, 1, CBAM, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]  # cat head P4
  - [-1, 2, C2f, [512]]  # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]  # cat head P5
  - [-1, 2, C2f, [1024]]  # 23(P5/32-large)

  - [[17, 21, 24], 1, Detect, [nc]]  # Detect(P3, P4, P5)
